Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Otherwise, specify the time to use for the operation (see Remarks for the format).
ja: それ以外の場合は、操作に使用する時間を指定します（形式は備考を参照）。

source: Otherwise, specify the title of the input box.
ja: そうでないときは、インプットボックスのタイトルを指定します。

source: Otherwise, specify the value to return on failure, such as if the requested key, section or file is not found.
ja: そうでなければ、リクエストされたキー、セクション、またはファイルが見つからない場合など、失敗時に返す値を指定します。

source: Otherwise, specify the value to write.
ja: そうでないときは、設定する値を指定します。

source: Otherwise, specify the word First to add the item as the first/top sibling, or specify the word Sort to insert it among its siblings in alphabetical order.
ja: そうでない場合は、Firstという単語を指定して、その項目を最初の兄弟／一番上の兄弟として追加するか、Sortという単語を指定して、その項目をアルファベット順に兄弟の中に挿入する。

source: Otherwise, specify the word Play to apply the delay to the SendPlay mode.
ja: そうでないときは、Playという単語を指定して遅延をSendPlayモードに適用させます。

source: Otherwise, specify the word Down (or the letter D) to press the mouse button down without releasing it.
ja: それ以外の場合は、マウスボタンを離さずに押し下げるDown（または文字D）を指定します。

source: Otherwise, specify thehe target encoding; for example, "UTF-8", "UTF-16" or "CP936".
ja: そうでない場合は、ターゲット・エンコーディングを指定する。例えば、"UTF-8"、"UTF-16"、"CP936"などである。

source: Otherwise, specify which loop this statement should apply to; either by label name or numeric nesting level.
ja: そうでないときは、ラベル名または数値のネストレベルのいずれかによってこのステートメントをどのループに適用するかを指定します。

source: Otherwise, specify zero or more of the following letters:
ja: それ以外の場合は、次の文字のうち0個以上を指定します：

source: Otherwise, specify zero or more of the following words, each separated from the next with a space or tab:
ja: それ以外の場合は、次の単語を0個以上、スペースまたはタブで区切って指定します：

source: Otherwise, the first operand that resolves to False is returned.
ja: そうでなければ、偽に解決される最初のオペランドが返される。

source: Otherwise, the last operand that resolves to False is returned.
ja: そうでなければ、偽に解決される最後のオペランドが返される。

source: Otherwise, the X button is disabled unless there is a Cancel button, in which case clicking the X is the same as pressing Cancel.
ja: それ以外の場合は、キャンセルボタンがない限りXボタンは無効で、その場合はXをクリックするとキャンセルを押したのと同じことになります。

source: Otherwise, the filter uses the indicated string but also provides an option for All Files (*.*) in the dialog's "files of type" drop-down list.
ja: そうでない場合は、指定された文字列を使用しますが、ダイアログの「ファイルの種類」ドロップダウンリストに「すべてのファイル（*.*）」のオプションも用意されています。

source: Otherwise, the first case which evaluates to true (non-zero and non-empty) is executed.
ja: そうでない場合は、最初に真（ゼロでなく、空でない）と評価されたケースが実行される。

source: Otherwise, the format for command line use is as follows:
ja: それ以外の場合、コマンドラインでの使用形式は以下の通り：

source: Otherwise, the function can check for a reference with param is VarRef, check if the target variable has a value with IsSetRef(param), and explicitly dereference it with %param%.
ja: それ以外の場合は，param is VarRefで参照を確認し，IsSetRef(param)で対象の変数に値があるかどうかを確認し，%param%で明示的に参照解除することができます。

source: Otherwise, the function can return a non-zero integer to prevent subsequent functions from being called.
ja: そうでない場合は、後続の関数が呼び出されないように、0以外の整数を返すことができます。

source: Otherwise, the function returns an empty string if Hwnd does not directly identify a GUI window.
ja: それ以外の場合、Hwndが直接GUIウィンドウを識別しない場合、この関数は空文字列を返します。

source: Otherwise, the function should return an integer, which is then returned to the caller.
ja: そうでない場合は、この関数は整数を返し、その整数は呼び出し元に返される必要があります。

source: Otherwise, the identified stack frame is used as follows to determine the other properties:
ja: それ以外の場合は、特定されたスタックフレームを以下のように使用して、他のプロパティを決定します：

source: Otherwise, the key name is determined according to the script's active keyboard layout.
ja: それ以外の場合は、スクリプトのアクティブなキーボードレイアウトに従って、キー名が決定されます。

source: Otherwise, the launcher optionally checks syntax.
ja: そうでなければ、ランチャーはオプションで構文をチェックする。

source: Otherwise, the modifier keys will not be pushed back down and the user will have to release and press them again to get them to modify the same or another key.
ja: そうしないと、修飾キーが押し戻されず、同じキーや別のキーを修飾させるために、ユーザーは一旦キーを離して再度押す必要があります。

source: Otherwise, the modifiers may be restored to the down position (get stuck down) even when the user isn't physically holding them down.
ja: そうでないと、ユーザーが物理的に押さえていなくても、モディファイアがダウンポジションに復元される（ダウンで動かなくなる）可能性があります。

source: Otherwise, the most common usage of this parameter is an asterisk followed immediately by the absolute path of the drive or folder to be initially selected.
ja: それ以外の場合、このパラメータの最も一般的な使用法は、アスタリスクの直後に、最初に選択されるドライブまたはフォルダの絶対パスが続くことです。

source: Otherwise, the recommended options are already filled in, so just click Install.
ja: それ以外の場合は、推奨されるオプションがすでに入力されていますので、そのまま「インストール」をクリックしてください。

source: Otherwise, the result is 0 (false).
ja: そうでなければ、結果は0（偽）である。

source: Otherwise, the result is a numeric string with exactly N decimal places.
ja: それ以外の場合は、小数点以下がちょうどN桁の数値文字列となります。

source: Otherwise, the result will be an integer.
ja: そうでないときは、戻り値は整数になります。

source: Otherwise, the return value is an integer between 0 and 255 representing the degree of transparency of the specified window, where 0 indicates an invisible window and 255 indicates an opaque window (see WinSetTransparent for how to set transparency).
ja: そうでなければ、戻り値は指定されたウィンドウの透明度を表す0から255の整数で、0は不可視ウィンドウ、255は不透明ウィンドウを表す（透明度の設定方法についてはWinSetTransparentを参照）。

source: Otherwise, the right operand becomes the result.
ja: そうでない場合は、右オペランドが結果になる。

source: Otherwise, the script exits after all registered functions are called.
ja: そうでない場合は、登録されたすべての関数が呼び出された後、スクリプトは終了する。

source: Otherwise, the search begins at the row after StartingRowNumber.
ja: そうでない場合は、StartingRowNumberの後の行から検索を開始します。

source: Otherwise, the setting will be set explicitly to the level indicated by NewSetting.
ja: そうでない場合は、NewSettingで示されたレベルに明示的に設定されます。

source: Otherwise, the value of the sub-expression Expr is used as the name or partial name of a variable or property.
ja: そうでない場合は、Expr部分式の値が変数やプロパティの名前または部分名として使われる。

source: Otherwise, the word "AutoHotkey" should be followed by any combination of the following, separated by spaces or tabs:
ja: そうでないときは、「AutoHotkey」という単語の後にスペースまたはタブで区切られた以下の任意の組み合わせが続く必要があります：

source: Otherwise, the word Join should be followed immediately by as many as 15 characters.
ja: そうでない場合は、Joinという語の直後に15文字でも続くようにする。

source: Otherwise, there will be no easy way to exit the program (without restarting the computer or killing the process).
ja: そうでなければ、（コンピュータを再起動したりプロセスを終了させたりせずに）プログラムを終了する簡単な方法がなくなります。

source: Otherwise, this function returns one of the following to indicate the relationship between VersionA and VersionB:
ja: そうでない場合、この関数は以下のいずれかを返し、VersionAとVersionBの関係を示す：

source: Otherwise, this is the username under which new processes will be created.
ja: それ以外の場合は、新しいプロセスが作成されるユーザー名となります。

source: Otherwise, this parameter can be the control's ClassNN, text or HWND, or an object with a Hwnd property.
ja: それ以外の場合は、コントロールのClassNN、テキスト、HWND、またはHwndプロパティを持つオブジェクトをパラメータとすることができます。

source: Otherwise, this parameter must be a function object.
ja: それ以外の場合は、このパラメータは関数オブジェクトでなければならない。

source: Otherwise, this parameter sets the maximum number of keyboard and mouse events that can be recorded for display in the window (default 40, limit 500).
ja: それ以外の場合、このパラメータは、ウィンドウに表示するために記録できるキーボードおよびマウスイベントの最大数を設定します（デフォルト40、上限500）。

source: Otherwise, this variable is equivalent to A_TimeIdle.
ja: そうでなければ、この変数はA_TimeIdleと等価である。

source: Otherwise, to refer to an existing global variable inside a function (or create a new one), declare the variable as global prior to using it.
ja: それ以外の場合、関数内で既存のグローバル変数を参照する（または新規に作成する）には、その変数を使用する前にグローバル変数として宣言します。

source: Otherwise, you can change your default editor via Editor settings in the Dash.
ja: そうでない場合は、Dashのエディター設定でデフォルトのエディターを変更できます。

source: Otherwise:
ja: それ以外：

source: Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for this service if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs; and that you know you can do these things.
ja: 私たちの一般公衆利用許諾契約は、あなたがフリー・ソフトウェアのコピーを配布する自由を有すること（そして、あなたが望むならば、このサービスに対して課金すること）、ソース・コードを受け取ること、あるいは、あなたがそれを望むならば、それを入手することができること、ソフトウェアを変更すること、あるいは、その一部を新しいフリー・プログラムに利用することができること、そして、あなたがこれらのことを行うことができることを知っていることを保証するために設計されています。

source: Our decision will be guided by the two goals of preserving the free status of all derivatives of our free software and of promoting the sharing and reuse of software generally.
ja: 私たちの決定は、私たちのフリーソフトウェアのすべての派生物のフリーの地位を維持することと、一般的にソフトウェアの共有と再利用を促進するという2つの目標によって導かれます。

source: Out format
ja: 出力フォーマット

source: Output format
ja: 出力フォーマット

source: Output types and how each is affected by the precision value are as follows (see table below for an explanation of the different output types):
ja: 出力の種類と精度値によるそれぞれの影響は以下の通りです（出力の種類についての説明は下表を参照）：

source: OutputDebug - Syntax & Usage | AutoHotkey v2
ja: OutputDebug - 構文と使用法｜AutoHotkey v2

source: Overrides the custom EXE icon used for compilation.
ja: コンパイルに使用されるカスタム EXE アイコンを上書きします。

source: Overrides the default codepage used to read script files.
ja: スクリプトファイルの読み込みに使われるデフォルトのコードページを上書きする。

source: Overriding or Disabling External Hotkeys
ja: ホットキーの上書きと無効化

source: Overriding or Disabling External Hotkeys | AutoHotkey v2
ja: ホットキーの上書きと無効化｜AutoHotkey v2

source: Overriding or Disabling Hotkeys
ja: ホットキーの上書きと無効化

source: Overriding or Disabling Hotkeys | AutoHotkey v2
ja: ホットキーの上書きと無効化｜AutoHotkey v2

source: Overriding the Base property does not affect the behaviour of this function.
ja: Baseプロパティをオーバーライドしても、この関数の動作に影響はありません。

source: Overwrite existing files.
ja: 既存のファイルを上書きします。

source: Overwrite files that were not previously registered by the installer, or that were modified since registration.
ja: インストーラによって以前に登録されていないか、登録後に変更されたファイルを上書きする。

source: Own properties, own methods and base are copied as per Obj.Clone.
ja: Obj.Cloneに準じて、自プロパティ、自メソッド、ベースはコピーされます。

source: Owned windows are not evaluated.
ja: 所有するウィンドウは評価対象外です。

source: Owned windows, such as certain dialogs and tool windows, are not evaluated.
ja: 特定のダイアログやツールウィンドウなど、所有するウィンドウは評価されません。

source: PCRE is optimized to abort early in some cases if it can determine that a match is not possible.
ja: PCREは、マッチが不可能と判断された場合、早期に中断するように最適化されている。

source: Paints via double-buffering, which reduces flicker.
ja: ダブルバッファリングによるペイントで、ちらつきを抑える。

source: Parameter pair
ja: パラメータペア

source: Parameter values can be retrieved by using NumGet.
ja: パラメータ値は、NumGetを用いて取得することができる。

source: Parameters
ja: パラメータ

source: Parameters (adjust to your path, if necessary):
ja: パラメータ（必要であれば、パスに合わせて調整してください。）

source: Parameters (adjust to your path, if necessary): /c ""C:\Program Files\AutoHotkey\AutoHotkey.exe" /ErrorStdOut "$File""
ja: パラメータ（必要であれば、パスに合わせて調整してください）：/c ""C:\Program Files\AutoHotkey\AutoHotkey.exe" /ErrorStdOut "$File""

source: Parameters and return value are defined by the function.
ja: パラメータと戻り値は、関数で定義されます。

source: Parameters are passed to a function, meaning that a value is specified for each parameter of the function when it is called.
ja: パラメータは関数に渡されます。つまり、関数が呼び出されたときに、関数の各パラメータに値が指定されることを意味します。

source: Parameters are defined by __New.
ja: パラメータは__Newで定義します。

source: Parameters are defined by listing them inside the parentheses.
ja: パラメータは、括弧の中に列挙することで定義されます。

source: Parameters are the same regardless of parentheses; i.e. there is no output variable for the return value, so it is discarded if parentheses are omitted.
ja: パラメータは括弧の有無にかかわらず同じです。すなわち、戻り値の出力変数は存在しないので、括弧が省略された場合は廃棄されることになります。

source: Parameters are usually omitted by literally omitting them from the code, but can also be omitted explicitly or conditionally by using the unset keyword.
ja: パラメータは通常、コードから文字通り省略することで省略されますが、unsetキーワードを使用することで明示的または条件付きで省略することも可能です。

source: Parameters can also be called arguments.
ja: パラメータは引数と呼ばれることもあります。

source: Parameters can be defined by enclosing them in square brackets to the right of the property name, and are passed the same way - but they should be omitted when parameters are not present (see below).
ja: パラメータは、プロパティ名の右側に角括弧で囲んで定義することができ、同じように渡されます - ただし、パラメータが存在しない場合は省略する必要があります（下記参照）。

source: Parameters containing spaces must be enclosed in double quotes.
ja: スペースを含むパラメータは二重引用符で囲む必要があります。

source: Parameters do not need to be formally declared if the function is variadic.
ja: 関数が変種である場合、パラメータを正式に宣言する必要はありません。

source: Parameters of this type are usually not used to modify the input string, but rather to pass back a string at a new address.
ja: このタイプのパラメータは、通常、入力文字列を変更するために使用されるのではなく、新しいアドレスで文字列を返すために使用されます。

source: Parameters that will be passed to Target when it is launched.
ja: Targetの起動時に渡されるパラメータです。

source: Parentheses are required when calling a method this way.
ja: この方法でメソッドを呼び出す場合は、括弧を付ける必要があります。

source: Parentheses can also be omitted when calling a method in this same context, but only when the target object is either a variable or a directly named property, such as myVar.myMethod or myVar.myProp.myMethod.
ja: 同じ文脈でメソッドを呼び出す場合、括弧を省略することもできますが、対象となるオブジェクトがmyVar.myMethodや myVar.myProp.myMethodのように変数や直接名前の付いたプロパティの場合のみです。

source: Parentheses can be omitted in function call statements (that is, function calls at the very beginning of the line), but in that case you cannot get the function's return value.
ja: 関数呼び出し文（つまり行頭の関数呼び出し）では括弧を省略することができますが、その場合、関数の戻り値を得ることはできません。

source: Parentheses can be used with Break or Continue, but in that case the parameter must be a single literal number or quoted string.
ja: 括弧はBreakやContinueでも使えますが、その場合、パラメータは1つのリテラル数値か引用符で囲まれた文字列でなければなりません。

source: Parentheses can be used with break or continue, but in that case the parameter must be a single literal number or quoted string.
ja: 括弧はbreakやcontinueでも使えますが、その場合、パラメータは1つのリテラル数値か引用符で囲まれた文字列でなければなりません。

source: Parentheses may be used to override precedence as in this example:
ja: この例のように、括弧を使用して優先順位を上書きすることができます。

source: Parentheses may be used to override precedence as in this example: (3 + 2) * 2
ja: この例のように、括弧を使用して優先順位を上書きすることができます：(3 + 2) * 2

source: Parses a comma separated value (CSV) file.
ja: CSV（Comma Separated Value）ファイルを解析します。

source: Parses a comma-separated string.
ja: カンマ区切りの文字列をパースします。

source: Parsing loops use less memory than StrSplit (though either way the memory use is temporary) and in most cases they are easier to use.
ja: 解析ループはStrSplitよりもメモリ使用量が少なく（どちらにしてもメモリ使用は一時的ですが）、ほとんどの場合、使い勝手が良いです。

source: Partial change is considered a success.
ja: 部分的な変更は成功とします。

source: Pass a positive integer to completely overwrite the window's style; that is, to set it to Value.
ja: 正の整数を渡すと、ウィンドウのスタイルを完全に上書きします。つまり、Valueに設定します。

source: Pass false to remove any requirement previously set by this function and potentially uninstall the hook.
ja: この関数によって以前に設定された要件を削除し、フックをアンインストールする可能性がある場合は false を渡します。

source: Pass parameters
ja: パラメータを渡す

source: Pass strings to external functions via DllCall.
ja: DllCallで外部関数に文字列を渡します。

source: Pass strings via PostMessage or SendMessage.
ja: PostMessageや SendMessageで文字列を渡す。

source: Pass the address of a RECT structure to GetWindowRect(), which sets the structure's members to the positions of the left, top, right, and bottom sides of a window (relative to the screen).
ja: RECT構造体のアドレスをGetWindowRect()に渡すと、構造体のメンバーにウィンドウの左、上、右、下辺の位置（画面に対する相対位置）が設定されます。

source: Pass to FillRect() the address of a RECT structure that indicates a part of the screen to temporarily paint red.
ja: FillRect()に、一時的に赤く塗る画面の一部を示すRECT構造体のアドレスを渡す。

source: Pass true for the second parameter to match the whole tab name, but unlike the v1 "Exact" mode, it is case-insensitive.
ja: 第2パラメータにtrueを渡すと、タブ名全体にマッチしますが、v1の「Exact」モードとは異なり、大文字と小文字は区別されません。

source: Passed directly to IsSet (e.g. IsSet(MyVar)).
ja: IsSetに直接渡される（例えば、IsSet(MyVar))。

source: Passes a VARIANT ByRef to a COM function.
ja: COM関数にVARIANT ByRefを渡します。

source: Passing Command Line Parameters to a Script
ja: スクリプトにコマンドラインパラメータを渡す

source: Passing a Buffer object instead of an address ensures that the source address can always be validated.
ja: アドレスの代わりにBufferオブジェクトを渡すことで、ソースアドレスを常に検証することができます。

source: Passing a Buffer object instead of an address ensures that the target address can always be validated.
ja: アドレスの代わりにBufferオブジェクトを渡すことで、ターゲットアドレスが常に検証できるようになります。

source: Passing a name (string) is no longer supported.
ja: 名前（文字列）の受け渡しはサポートされなくなりました。

source: Passing an empty title (not omitting it) now results in an empty title, not the default title.
ja: 空のタイトルを渡すと（省略せずに）、デフォルトのタイトルではなく、空のタイトルが表示されるようになりました。

source: Passing an invalid index may cause undefined behaviour, including (but not limited to) program termination.
ja: 無効なインデックスを渡すと、プログラムの終了を含む未定義の動作が発生する可能性があります（ただし、これに限定されるものではありません）。

source: Passing an invalid pointer may cause undefined behaviour, including (but not limited to) program termination.
ja: 無効なポインタを渡すと、プログラムの終了を含む未定義の動作を引き起こす可能性があります（ただし、これに限定されるものではありません）。

source: Passing an object with these properties ensures that the function does not read memory from an invalid location; doing so could cause crashes or other unpredictable behaviour.
ja: これらのプロパティを持つオブジェクトを渡すことで、関数が不正な場所からメモリを読み込むことがないようにします。そうすると、クラッシュやその他の予測不可能な動作が起こる可能性があります。

source: Passing an object with these properties ensures that the function does not write memory to an invalid location; doing so could cause crashes or other unpredictable behaviour.
ja: これらのプロパティを持つオブジェクトを渡すことで、関数が不正な場所にメモリーを書き込まないようにします。

source: Passing an object with these properties ensures that the function does not write to an invalid memory location; doing so could cause crashes or other unpredictable behaviour.
ja: これらのプロパティを持つオブジェクトを渡すことで、関数が無効なメモリ位置に書き込まないようにします。そうすると、クラッシュやその他の予測不可能な動作の原因になります。

source: Passing the address back to NumPut is less safe than passing a Buffer-like object with an updated Offset.
ja: NumPutにアドレスを返すのは、Offsetを更新したBufferのようなオブジェクトを渡すよりも安全性に欠けます。

source: Passing the address of a variable (formerly &var, now StrPtr(var)) no longer updates the variable's length (use VarSetStrCapacity(&var, -1)).
ja: 変数のアドレス（以前は&var、現在はStrPtr(var)）を渡しても、変数の長さを更新しなくなりました（VarSetStrCapacity(&var, -1)を使用してください）。

source: Passing the address to CallbackFree will delete the callback.
ja: CallbackFreeにアドレスを渡すと、コールバックが削除されます。

source: Passing the value to Send would produce a shifted keystroke instead of a plain one.
ja: Sendに値を渡すと、プレーンなキーストロークではなく、シフトしたキーストロークが生成されます。

source: Passing this reference to a function or storing it in a variable or another object creates a new reference to the same object.
ja: この参照を関数に渡したり、変数や別のオブジェクトに格納したりすると、同じオブジェクトへの新しい参照が作成されます。

source: Passing too few or too many parameters, which can often be avoided by checking the function's MinParams, MaxParams and IsVariadic properties.
ja: 関数のMinParams、MaxParams、IsVariadicプロパティを確認することで回避できることが多い。

source: Paste the contents of the clipboard (that is, the screenshot).
ja: クリップボードの内容（つまり、スクリーンショット）を貼り付けます。

source: Pastes the specified string at the caret (text insertion point) in an Edit control.
ja: エディットコントロールのキャレット（テキストの挿入位置）に指定された文字列を貼り付けます。

source: Path Must Exist
ja: パスは存在しなければならない

source: Pattern-matching may proceed or fail depending on the return value of the RegEx callout function:
ja: パターンマッチングは、RegExコールアウト関数の返り値によって進行したり失敗したりする：

source: Patterns longer than 259 characters may fail to find any files due to system limitations (MAX_PATH).
ja: 259文字以上のパターンは、システムの制限（MAX_PATH）により、ファイルの検索に失敗する場合があります。

source: Pause - Syntax & Usage | AutoHotkey v2
ja: Pause - 構文と使用法｜AutoHotkey v2

source: Pause Script - Pause or unpause the script.
ja: スクリプトの一時停止 - スクリプトを一時停止または一時停止解除します。

source: Pause::Pause -1 ; The Pause/Break key.
ja: Pause::Pause -1 ; Pause/Break キー

source: Pauses the script's current thread or sets the pause state of the underlying thread.
ja: 現在のスレッドを一時停止、または基礎となるスレッドの停止状態を設定します。

source: Pauses the script's current thread.
ja: スクリプトの現在のスレッドを一時停止します。

source: People usually use 3 or 4 spaces or 1 tab per "level".
ja: 通常、「レベル」ごとに3つか4つのスペースか1つのタブを使う。

source: Per-Monitor DPI Awareness
ja: モニターごとのDPI認識

source: Per-monitor DPI awareness can be enabled process-wide by changing the content of the <dpiAware> element of the compiled script's manifest resource from true (the default set in the base AutoHotkey executable file) to true/pm.
ja: モニタごとの DPI 認識は、コンパイルされたスクリプトのマニフェストリソースの <dpiAware>要素の内容をtrue（基本のAutoHotkey実行ファイルに設定されているデフォルト）からtrue/pmに変更することで、プロセス全体で有効にすることができます。

source: Percent signs cannot be used directly within Expr due to ambiguity, but can be nested within parentheses.
ja: パーセント記号は、曖昧さのためにExpr内で直接使用することはできないが、括弧内に入れ子にすることはできる。

source: Percent signs which are not part of a valid variable reference are interpreted literally.
ja: 有効な変数参照の一部でないパーセント記号は、文字通りに解釈されます。

source: Percentage number between -100 and 100 inclusive (it can be a floating point number).
ja: 100から100までのパーセント数（浮動小数点数でも可）。

source: Performance
ja: パフォーマンス

source: Performance can be dramatically improved when making repeated calls to a DLL by loading it beforehand.
ja: DLLを繰り返し呼び出す場合、あらかじめロードしておくことでパフォーマンスを飛躍的に向上させることができます。

source: Performance continues to improve as more and more expressions are combined into a single expression; for example, it may be 35 % faster to combine five or ten simple expressions into a single expression.
ja: たとえば、5つまたは10個の単純な式を1つの式にまとめると、35%速くなることがあります。

source: Performance is slightly reduced when using a dynamic label (that is, a variable or expression which returns a label name) because the target label must be "looked up" each time rather than only once when the script is first loaded.
ja: 動的ラベル（ラベル名を返す変数や式）を使用する場合、スクリプトを最初に読み込んだときに一度だけではなく、毎回ターゲットラベルを「検索」する必要があるため、パフォーマンスがわずかに低下します。

source: Performance may be slightly improved if Target is an exact path, e.g. Run 'C:\Windows\Notepad.exe "C:\My Documents\Test.txt"' rather than Run "C:\My Documents\Test.txt".
ja: Run "C:\My Documents\Test.txt"よりもRun 'C:\Windows\Notepad.exe "C:\My Documents\Test.txt"'のようにTargetが完全パスであればパフォーマンスは若干向上するかもしれません。

source: Performance may be substantially better than the slow mode, but certain types of controls are not detected.
ja: パフォーマンスはスローモードよりも大幅に向上するかもしれないが、ある種のコントロールは検出されない。

source: Performance-related remarks about redraw behaviour of controls.
ja: コントロールの再描画動作に関するパフォーマンスに関する注意事項。

source: Performs a double-click at the mouse cursor's current position.
ja: マウスカーソルの現在位置でダブルクリックを行います。

source: Performs a series of functions repeatedly until the specified expression evaluates to false.
ja: 指定された式がfalseになるまで、一連の関数を繰り返し実行します。

source: Performs a series of functions repeatedly:
ja: 一連の機能を繰り返し実行します：

source: Performs a simple rename.
ja: 単純なリネームを行います。

source: Performs an operation on the contents of a variable and stores the result back in the same variable.
ja: 変数の内容に演算を行い、結果を同じ変数に戻す。

source: Performs one or more statements repeatedly until the specified expression evaluates to false.
ja: 指定された式がfalseと評価されるまで、1つ以上の文を繰り返し実行します。

source: Perhaps the system couldn't find "wordpad", but what it's really saying is that there is no such file as "wordpad C:\...".
ja: おそらく、システムは「wordpad」を見つけられなかったのでしょうが、本当に言っているのは、「wordpad C:\…」というようなファイルが存在しない、ということなのでしょう。

source: Period/era string for the current user's locale (blank if none)
ja: 現在のユーザーのロケールに対応する時代・年代の文字列（ない場合は空白）

source: Periodic message checks during Send, file and download operations.
ja: 送信、ファイル、ダウンロード操作時に定期的にメッセージチェックを行う。

source: Permanently displays a TrayTip by refreshing it periodically via timer.
ja: タイマーで定期的に更新することにより、TrayTipを永続的に表示します。

source: Permission denied.
ja: 許可は拒否されました。

source: Permits the variable to be unset.
ja: 変数のアンセットを許可する。

source: Persistence
ja: 永続性

source: Persistent - Syntax & Usage | AutoHotkey v2
ja: Persistent - 構文と使用法｜AutoHotkey v2
